"""
Приклад 9.3. Дано текстовий файл, що містить послідовність слів.
Крім цього задано пару слів w1 та w2.
Замінити у файлі усі входження слова w1, словом w2.
"""


f_name = input("Введіть ім'я файлу ")
w1 = input("Задайте w1 ")
w2 = input("Задайте w2 ")

f = open(f_name) # Відкриваємо текстовий для читання
f_lines = f.readlines()  # Зчитуємо рядки файлa f у f_lines
f.close()       # Закриваємо файл, щоб перезаписати його

f = open(f_name, "w")       # Перезаписуємо файл
for s in f_lines:           # Пробігаємо список усіх рядків
    s1 = s.replace(w1, w2)  # Будуємо рядок s1 по рядку s у
                             # якому слова w1 замінено на w2
    print(s1, file = f, end = "")  # Записуємо s1 у файл f

f.close()





