"""
Приклад 9.4. Нехай задано деякий об'єкт з даними (наприклад, словник).
Потрібно сереалізувати цей об'єкт у файл з допомогою модуля pickle.
Відновити дані з файлу і вивести на екран.
"""

import pickle
# Дані записані у вигляді словника
data = {
    'a': [1, 2.0, 3, 4 + 6j],
    'b': ("String", "Hello"),
    'c': {None, True, False}
}

f_name = input("Введіть ім'я файлу ")
f = open(f_name, "wb")    # Відкриваємо файл для читання
pickle.dump(data, f)      # Сереалізація даних у файл
f.close()                 # Закриваємо файл

f = open(f_name, "rb")    # Відкриваємо файл для читання
data_new = pickle.load(f) # Десереалізуємо дані у data_new
f.close()
print(data_new)




