"""
Приклад 4.4. Визначити найменший з елементів квадратної дійсної матриці порядку N.
"""

# Блок введення матриці з клавіатури
N = int(input("Кількість рядків матриці "))
M = []            # Створюємо порожню матрицю
for i in range(N):
    # Вводимо рядок матриці row з клавіатури
    row = list(map(float, input("%d: " % i).split()))
    M.append(row)  # Додаємо рядок до матриці

# Пошук найменшого
min = M[0][0]
for row in M:
    for elem in row:
        if elem <= min:
            min = elem

print(min)
