"""
Приклад 4.4. Визначити найменший з елементів квадратної дійсної матриці порядку N.
"""

# Блок введення матриці з клавіатури
N = int(input("Кількість рядків матриці "))
M = []            # Створюємо порожню матрицю
for i in range(N):
    # Вводимо рядок матриці row з клавіатури
    row = list(map(float, input("%d: " % i).split()))
    M.append(row)  # Додаємо рядок до матриці

# Визначення чи є матриця симетрична
n = len(M)
res = True
for i in range(n):
    for j in range(n):
        if M[i][j] != M[j][i]:
            res = False

print(res)
