"""
Приклад 6.1. Слова у рядку розділяються одним або декількома пропусками.
Визначити кількість входжень кожного слова до рядка.
"""
S = input("введіть рядок: ")
words_list = S.split()  # розбиваємо рядок на список слів
d = {}                  # порожній словник слів
for word in words_list: # пробігаємо по всіх словах
    if word not in d:   # якщо слово не входить до списку
                        # додаємо його до словника разом з
                        # його кількістю входжень
        d[word] = words_list.count(word)

print('слова та кількість входжень:', d)
