"""
Приклад 6.2. Визначити слово, яке входить до тексту найбільшу кількість разів.
"""

# У цій задачі можемо використати результат отриманий у прикладі 6.1.
S = input("введіть рядок: ")
words_list = S.split()  # розбиваємо рядок на список слів
d = {}                  # порожній словник слів
for word in words_list: # пробігаємо по всіх словах
    if word not in d:   # якщо слово не входить до списку
                        # додаємо його до словника разом з
                        # його кількістю входжень
        d[word] = words_list.count(word)

m = 0          # m - максимальна кількість входжень
max_word = ''  # max_word – змінна що містить слово,
               # яке входить найбільшу кількість разів
for word, count in d.items(): # пробігаємо словник по
                              # всіх парах ключ-значення
    if m < count:
        m = count
        max_word = word

print('слово, яке входить найчастіше -', max_word)




