"""
Приклад 3.1. Визначити чи є введене з клавіатури число N простим.

Розв’язок. Згідно з означенням, простими називаються натуральні числа більші за 1,
які діляться лише на 1 і на себе. Отже, для того, щоб вияснити, чи є число простим,
необхідно поділити його на всі числа від 2 до N-1. Якщо так станеться,
що число N поділиться без остачі хоча б на одне з них,
то це і буде означати, що воно не просте.
"""

N = int(input("N = "))
prime = True          # Вважаємо спочатку, що число є простим
i = 2                 # Починаючи з 2
while i <= N-1:       # до N-1 включно
    if N % i == 0:    # якщо N ділиться без остачі на і
        prime = False # То воно не є простим
    i = i + 1         # Беремо наступне і

if prime:
    print("Число", N, "є простим")
else:
    print("Число", N, "не є простим")


