"""
Приклад 3.2. Знайти суму цифр заданого натурального числа.


Розв’язок. Для розв'язання задачі треба розкласти число на цифри.
Для цього, досить згадати, що ми використовуємо позиційну десяткову систему числення.
Таким чином, беручи остачу від ділення числа на 10 будемо отримувати останню цифру числа,
а діленням націло на 10 прибирати цю цифру з запису числа. Наприклад,
                    256 % 10 = 6,
                    256 // 10 = 25.
Очевидно, що повторюючи ці дві операції поки число лишається більшим за нуль і
підсумовуючи у деякій змінній отримані остачі отримаємо бажаний результат.

"""

N = int(input("N = "))
suma = 0            # Змінна, у якій буде міститися сума
while N > 0:        # Поки число не нульове (має цифри)
    last = N % 10   # Визначаємо останню цифру числа
    suma += last    # Додаємо її до змінної suma
    N //= 10        # Прибираємо останню цифру числа
print("Сума цифр заданого числа є", suma)



