"""
Приклад 3.10. Задано послідовність чисел, що завершується числом 0,
серед елементів якої є принаймні одне додатне число.
Потрібно знайти найбільше серед додатних чисел.
"""

max = 0    # Поточний найбільший член послідовності
while True:       # Завершення циклу буде через break
    a = float(input("Задайте член послідовності"))
    if a == 0:    # якщо введене число 0,
        break     # завершуємо цикл
    elif a < 0:   # якщо введене число < 0,
        continue  # переходимо на початок циклу
    max = a if a > max else max

print("Найбільшим є число", max)


