"""
Приклад 3.3. Дано натуральне число K.
Скласти програму знаходження всіх натуральних чисел менших або рівних K,
які при піднесенні до квадрата дають паліндром.

Натуральне число називається паліндромом, якщо його запис читається
однаково зліва направо і справа наліво.
Наприклад, числа 12321,626,10001 є паліндромами.

"""

K = int(input("K = "))
k = 1
while k <= K:
    N = k * k

    # Будуємо обернений запис числа N
    P = 0  # P буде містити обернений запис числа N
    while N > 0:
        last = N % 10
        P = P * 10 + last
        N //= 10

    # Якщо обернений запис числа N збігається з N=k**2
    if P == k * k:
        print(k) # Виводимо k на екран
    k += 1




