"""
Приклад 3.7. Дано натуральне число n. Написати програму для обчислення значень многочлена
                         y(x)=x^n+x^(n-1)+...+x^2+x+1
при заданому значенні x.

"""

x = int(input("x = "))
n = int(input("n = "))

# =========== Спосіб 1 ======================
z = 1
y = 1
for i in range(1, n + 1):
    z *= x
    y += z

print("y(%f) = %f" %(x, y))

# =========== Спосіб 2 ======================
"""
Скористаємось схемою Горнера. Розставивши дужки таким чином:
y = x^n  + x^(n-1)  +⋯+ x^2  + x + 1 = =(...(x + 1) x + 1) x +...+ 1) x + 1
"""

y = 1
for i in range(1, n + 1):
    y = y * x + 1

print("y(%f) = %f" %(x, y))





