"""
Приклад 5.12. Нехай у рядку міститься послідовність слів, що розділена
одним чи декількома символами пропуску. Необхідно видалити зайві пропуски
між словами, так, щоб слова розділялися лише одним символом пропуску.
Також видалити всі пропуски на початку та вкінці рядка.
"""

S = input("Введіть рядок ")
                 # S = "  інформатика   та  програмування   "
l = S.split()    # l = ['інформатика', 'та', 'програмування']
result = " ".join(l)
                 # result = "інформатика та програмування"
print(result)

