"""
Приклад 5.6. Перевірити, чи правильно в заданому виразі розставлені круглі дужки
(тобто, чи стоїть справа від кожної відкритої дужки відповідна до неї закрита дужка,
а зліва від кожної закритої – відповідна до неї відкрита).
"""

expression = input("Введіть вираз ")
k = 0    # різниця кількості відкритих і закритих дужок
r = True # закритій дужці відповідає відкрита
for c in expression:
    if c == '(':
        k += 1
    if c == ')':
        k -= 1
    if k < 0: # закритій дужці не відповідає відкрита
        r = False
        break

if (k == 0 and r):
    print("Дужки розставлені правильно")
else:
    print("Дужки розставлені неправильно")


