"""
Приклад 8.4. Для заданої функції потрібно побудувати таблицю її значень.
"""

import math


def table(l, f):    # l – список точок, f - функція
    d = {}          # Словник d - таблиця значень функції
    for x in l:     # Проходимо по всіх х
        d[x] = f(x) # Додаємо пару (x, f(x)) у словник
    return d        # Повертаємо таблицю (словник)
# Створюємо список точок, що є розбиттям відрізка
# [0, pi] на 5 частин
l = [x * math.pi / 10 for x in range(6)]
# Будуємо таблицю значень функції sin для заданого списку
D = table(l, math.sin)

# Виводимо результат на екран у вигляді sin(0) = 0
for x in l:
    print("sin(%f) = %f" % (x, D[x]))





